cmsis-svd/cmsis-svd/data/GigaDevice/GD32F4xx.svd
       </registers>
    </peripheral>
    <peripheral derivedFrom="ADC0">
      <name>ADC1</name>
      <baseAddress>0x40012100</baseAddress>
      <interrupt>
        <name>ADC</name>
        <value>18</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="ADC0">
      <name>ADC2</name>
      <baseAddress>0x40012200</baseAddress>
      <interrupt>
        <name>ADC</name>
        <value>18</value>
      </interrupt>
    </peripheral>
  <peripheral>
      <name>ADC_Common</name>
      <description>common ADC register</description>
      <baseAddress>0x40012300</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x100</size>
        <usage>registers</usage>
      </addressBlock>
     <registers>
      <register>
          <name>SSTAT</name>
          <displayName>SSTAT</displayName>
          <description>summary status register</description>
          <addressOffset>0x00</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ROVF2</name>
              <description>This bit equals to the ROVF bit of ADC2</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STRC2</name>
              <description>This bit equals to the STRC bit of ADC2</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STIC2</name>
              <description>This bit equals to the STIC bit of ADC2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOIC2</name>
              <description>This bit equals to the EOIC bit of ADC2</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOC2</name>
              <description>This bit equals to the EOC bit of ADC2</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WDE2</name>
              <description>This bit equals to the WDE bit of ADC2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ROVF1</name>
              <description>This bit equals to the ROVF bit of ADC1</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STRC1</name>
              <description>This bit equals to the STRC bit of ADC1</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STIC1</name>
              <description>This bit equals to the STIC bit of ADC1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOIC1</name>
              <description>This bit equals to the EOIC bit of ADC1</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOC1</name>
              <description>This bit equals to the EOC bit of ADC1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WDE1</name>
              <description>This bit equals to the WDE bit of ADC1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ROVF0</name>
              <description>This bit equals to the ROVF bit of ADC0</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STRC0</name>
              <description>This bit equals to the STRC bit of ADC0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STIC0</name>
              <description>This bit equals to the STIC bit of ADC0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOIC0</name>
              <description>This bit equals to the EOIC bit of ADC0</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOC0</name>
              <description>This bit equals to the EOC bit of ADC0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WDE0</name>
              <description>This bit equals to the WDE bit of ADC0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNCCTL</name>
          <displayName>SYNCCTL</displayName>
          <description>sync control register</description>
          <addressOffset>0x04</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TSVREN</name>
              <description>Channel 16 (temperature sensor) and 
	     17 (internal reference voltage) enable of ADC0</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VBATEN</name>
              <description>Channel 18 (1/4 voltate of external battery) enable 
	     of ADC0</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADCCK</name>
              <description>ADC clock</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SYNCDMA</name>
              <description>ADC sync DMA mode selection</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SYNCDDM</name>
              <description>ADC sync DMA disable mode</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYNCDLY</name>
              <description>ADC sync delay</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SYNCM</name>
              <description>ADC sync mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNCDATA</name>
          <displayName>SYNCDATA</displayName>
          <description>Sync regular data register</description>
          <addressOffset>0x08</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SYNCDATA2</name>
              <description>Regular data2 in ADC sync mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>SYNCDATA1</name>
              <description>Regular data1 in ADC sync mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
