cmsis-svd/cmsis-svd/data/GigaDevice/GD32F4xx.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="DMA0">
      <name>DMA1</name>
      <baseAddress>0x40026400</baseAddress>
      <interrupt>
        <name>DMA1_Channel0</name>
        <value>56</value>
      </interrupt>
      <interrupt>
        <name>DMA1_Channel1</name>
        <value>57</value>
      </interrupt>
      <interrupt>
        <name>DMA1_Channel2</name>
        <value>58</value>
      </interrupt>
      <interrupt>
        <name>DMA1_Channel3</name>
        <value>59</value>
      </interrupt>
      <interrupt>
        <name>DMA1_Channel4</name>
        <value>60</value>
      </interrupt>
      <interrupt>
        <name>DMA1_Channel5</name>
        <value>68</value>
      </interrupt>
      <interrupt>
        <name>DMA1_Channel6</name>
        <value>69</value>
      </interrupt>
      <interrupt>
        <name>DMA1_Channel7</name>
        <value>70</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>ENET_DMA</name>
      <description>Ethernet: DMA controller operation</description>
      <groupName>ENET</groupName>
      <baseAddress>0x40029000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x60</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DMA_BCTL</name>
          <displayName>DMA_BCTL</displayName>
          <description>Ethernet DMA bus control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00020101</resetValue>
          <fields>
            <field>
              <name>SWR</name>
              <description>Software reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DAB</name>
              <description>DMA Arbitration</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DPSL</name>
              <description>Descriptor skip length</description>
              <bitOffset>2</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>DFM</name>
              <description>Descriptor format mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGBL</name>
              <description>Programmable burst length</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>RTPR</name>
              <description>RxDMA and TxDMA transfer priority ratio</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>FB</name>
              <description>Fixed burst</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXDP</name>
              <description>Rx DMA PGBL</description>
              <bitOffset>17</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>UIP</name>
              <description>Use independent PGBL</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FPBL</name>
              <description>Four times PGBL mode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AA</name>
              <description>Address-aligned </description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MB</name>
              <description>Mixed burst</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_TPEN</name>
          <displayName>DMA_TPEN</displayName>
          <description>Ethernet DMA transmit poll enable
          register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TPE</name>
              <description>Transmit poll enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_RPEN</name>
          <displayName>DMA_RPEN</displayName>
          <description>Ethernet DMA receive poll enable
          register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RPE</name>
              <description>Receive poll enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_RDTADDR</name>
          <displayName>DMA_RDTADDR</displayName>
          <description>Ethernet DMA receive descriptor table address
          register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SRT</name>
              <description>Start address of receive table</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_TDTADDR</name>
          <displayName>DMA_TDTADDR</displayName>
          <description>Ethernet DMA transmit descriptor table
          address register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STT</name>
              <description>Start address of transmit table</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_STAT</name>
          <displayName>DMA_STAT</displayName>
          <description>Ethernet DMA status register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TS</name>
              <description>Transmit status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TPS</name>
              <description>Transmit process stopped
              status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TBU</name>
              <description>Transmit buffer unavailable
              status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TJT</name>
              <description>Transmit jabber timeout
              status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RO</name>
              <description>Receive overflow status</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TU</name>
              <description>Transmit underflow status</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RS</name>
              <description>Receive status</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RBU</name>
              <description>Receive buffer unavailable
              status</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RPS</name>
              <description>Receive process stopped
              status</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RWT</name>
              <description>Receive watchdog timeout
              status</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ET</name>
              <description>Early transmit status</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FBE</name>
              <description>Fatal bus error status</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ER</name>
              <description>Early receive status</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AI</name>
              <description>Abnormal interrupt summary</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NI</name>
              <description>Normal interrupt summary</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RP</name>
              <description>Receive process state</description>
              <bitOffset>17</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TP</name>
              <description>Transmit process state</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EB</name>
              <description>Error bits status</description>
              <bitOffset>23</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MSC</name>
              <description>MSC status</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WUM</name>
              <description>WUM status</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TST</name>
              <description>Time stamp trigger status</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_CTL</name>
          <displayName>DMA_CTL</displayName>
          <description>Ethernet DMA control
          register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SRE</name>
              <description>Start/stop receive enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OSF</name>
              <description>Operate on second frame</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RTHC</name>
              <description>Receive threshold control</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>FUF</name>
              <description>Forward undersized good frames</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FERF</name>
              <description>Forward error frames</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STE</name>
              <description>Start/stop transmission enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TTHC</name>
              <description>Transmit threshold control</description>
              <bitOffset>14</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>FTF</name>
              <description>Flush transmit FIFO</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSFD</name>
              <description>Transmit Store-and-Forward</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DAFRF</name>
              <description>Disable flushing of received frames</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RSFD</name>
              <description>Receive Store-and-Forward</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTCERFD</name>
              <description>Dropping of TCP/IP checksum error frames disable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_INTEN</name>
          <displayName>DMA_INTEN</displayName>
          <description>Ethernet DMA interrupt enable
          register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TIEN</name>
              <description>Transmit interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TPSIEN</name>
              <description>Transmit process stopped interrupt
              enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TBUIEN</name>
              <description>Transmit buffer unavailable interrupt
              enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TJTIEN</name>
              <description>Transmit jabber timeout interrupt
              enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ROIEN</name>
              <description>Receive overflow interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TUIEN</name>
              <description>Transmit underflow interrupt enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RIEN</name>
              <description>Receive interrupt enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RBUIEN</name>
              <description>Receive buffer unavailable interrupt
              enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RPSIEN</name>
              <description>Receive process stopped interrupt
              enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RWTIEN</name>
              <description>receive watchdog timeout interrupt
              enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ETIEN</name>
              <description>Early transmit interrupt
              enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FBEIEN</name>
              <description>Fatal bus error interrupt
              enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERIEN</name>
              <description>Early receive interrupt
              enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AIEN</name>
              <description>Abnormal interrupt summary
              enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NIEN</name>
              <description>Normal interrupt summary
              enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_MFBOCNT</name>
          <displayName>DMA_MFBOCNT</displayName>
          <description>Ethernet DMA missed frame and buffer
          overflow counter register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MSFC</name>
              <description>Missed frames by the
              controller</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>MSFA</name>
              <description>Missed frames by the
              application</description>
              <bitOffset>17</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_RSWDC</name>
          <displayName>DMA_RSWDC</displayName>
          <description>Ethernet DMA receive state watchdog counter
          register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WDCFRS</name>
              <description> Watchdog counter for receive status (RS)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_CTDADDR</name>
          <displayName>DMA_CTDADDR</displayName>
          <description>DMA current transmit descriptor address
            register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TDAP</name>
              <description> transmit descriptor address
              pointer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_CRDADDR</name>
          <displayName>DMA_CRDADDR</displayName>
          <description>Ethernet DMA current receive descriptor address
          register</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RDAP</name>
              <description>Receive descriptor address pointer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_CTBADDR</name>
          <displayName>DMA_CTBADDR</displayName>
          <description>Ethernet DMA current transmit buffer address
           register</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TBAP</name>
              <description>Transmit buffer address pointer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
