cmsis-svd/cmsis-svd/data/GigaDevice/GD32F4xx.svd
        <register>
          <name>SAMCS</name>
          <displayName>SAMCS</displayName>
          <description>SAM control and status register</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>SAMEN</name>
              <description>SAM_V interface enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
             <access>read-write</access>
            </field>
            <field>
              <name>STOEN</name>
              <description>SAM_V interface timeout detect enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
             <access>read-write</access>
            </field>
             <field>
              <name>TFFIE</name>
              <description>Txframe fall interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
             <access>read-write</access>
            </field>
            <field>
              <name>TFRIE</name>
              <description>Txframe rise interrupt enable</description>
              <bitOffset>5</bitOffset>
             <access>read-write</access>
              <bitWidth>1</bitWidth>
            </field>
             <field>
              <name>RFFIE</name>
              <description>Rxframe fall interrupt enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
             <access>read-write</access>
            </field>
            <field>
              <name>RFRIE</name>
              <description>Rxframe rise interrupt enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
             <access>read-write</access>
            </field>
            <field>
              <name>TXF</name>
              <description>Level of Txframe signal</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
             <access>read-only</access>
            </field>
            <field>
              <name>RXF</name>
              <description>Level of Rxframe signal</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
             <access>read-only</access>
            </field>
            <field>
              <name>TFF</name>
              <description>Txframe fall flag</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
             <access>read-write</access>
            </field>
            <field>
              <name>TFR</name>
              <description>Txframe rise flag</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
             <access>read-write</access>
            </field>
            <field>
              <name>RFF</name>
              <description>Rxframe fall flag</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
             <access>read-write</access>
            </field>
           <field>
              <name>RFR</name>
              <description>Rxframe rise flag</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
             <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="I2C0">
      <name>I2C1</name>
      <baseAddress>0x40005800</baseAddress>
      <interrupt>
        <name>I2C1_EV</name>
        <value>33</value>
      </interrupt>
      <interrupt>
        <name>I2C1_ER</name>
        <value>34</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="I2C0">
      <name>I2C2</name>
      <baseAddress>0x40005C00</baseAddress>
      <interrupt>
        <name>I2C2_EV</name>
        <value>72</value>
      </interrupt>
      <interrupt>
        <name>I2C2_ER</name>      
        <value>73</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>IPA</name>
      <description>Image processing accelerator</description>
      <groupName>IPA</groupName>
      <baseAddress>0x4002B000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xC00</size>
        <usage>registers</usage>
      </addressBlock>
       <interrupt>
        <name>IPA</name>
        <value>90</value>
      </interrupt>
      <registers>
        <register>
          <name>IPA_CTL</name>
          <displayName>IPA_CTL</displayName>
          <description>Control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TEN</name>
              <description>Transfer enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>THU</name>
              <description>Transfer hang up</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TST</name>
              <description>Transfer stop</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TAEIE</name>
              <description>Enable bit for transfer access error interrupt</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FTFIE</name>
              <description>Enable bit for full transfer finish interrupt</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TLMIE</name>
              <description>Enable bit for transfer line mark interrupt</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LACIE</name>
              <description>Enable bit for LUT access conflict interrupt</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LLFIE</name>
              <description>Enable bit for LUT loading finish interrupt</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WCFIE</name>
              <description>Enable bit for wrong configuration interrupt</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PFCM</name>
              <description>Pixel format convert mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPA_INTF</name>
          <displayName>IPA_INTF</displayName>
          <description>Interrupt flag
          register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TAEIF</name>
              <description>Transfer access error interrupt flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FTFIF</name>
              <description>Full transfer finish interrupt flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TLMIF</name>
              <description>Transfer line mark interrupt flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LACIF</name>
              <description>LUT access conflict interrupt flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LLFIF</name>
              <description>LUT loading finish interrupt flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WCFIF</name>
              <description>Wrong configuration interrupt flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPA_INTC</name>
          <displayName>IPA_INTC</displayName>
          <description>Interrupt flag clear
          register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TAEIFC</name>
              <description>Clear bit for transfer access error interrupt flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TFIFC</name>
              <description>Clear bit for full transfer finish interrupt flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TLMIF</name>
              <description>Clear bit for transfer line mark interrupt flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LACIFC</name>
              <description>Clear bit for LUT access conflict interrupt flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LLFIFC</name>
              <description>Clear bit for LUT loading finish interrupt flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CWCFIF</name>
              <description>Clear bit for wrong configuration interrupt flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPA_FMADDR</name>
          <displayName>IPA_FMADDR</displayName>
          <description>Foreground memory base address
          register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FMADDR</name>
              <description>Foreground memory base address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPA_FLOFF</name>
          <displayName>IPA_FLOFF</displayName>
          <description>Foreground line offset register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FLOFF</name>
              <description>Foreground line offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPA_BMADDR</name>
          <displayName>IPA_BMADDR</displayName>
          <description>Background memory base address register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BMADDR</name>
              <description>Background memory base address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPA_BLOFF</name>
          <displayName>IPA_BLOFF</displayName>
          <description>Background line offset
          register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BLOFF</name>
              <description>Background line offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPA_FPCTL</name>
          <displayName>IPA_FPCTL</displayName>
          <description>Foreground pixel control
          register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FPF</name>
              <description>Foreground pixel format</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>FLPF</name>
              <description>Foreground LUT pixel format</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLLEN</name>
              <description>Foreground LUT loading enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FCNP</name>
              <description>Foreground LUT number of pixel</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>FAVCA</name>
              <description>Foreground alpha value calculation algorithm</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>FPDAV</name>
              <description>Foreground pre- defined alpha value</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPA_FPV</name>
          <displayName>IPA_FPV</displayName>
          <description>Foreground pixel value register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FPDBV</name>
              <description>Foreground pre-defined blue value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>FPDGV</name>
              <description>Foreground pre-defined green value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>FPDRV</name>
              <description>Foreground pre-defined red value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPA_BPCTL</name>
          <displayName>IPA_BPCTL</displayName>
          <description>Background pixel control
          register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BPF</name>
              <description> Background pixel format</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>BLPF</name>
              <description> Background LUT pixel format</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BLLEN</name>
              <description> Background LUT loading enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BCNP</name>
              <description> Background LUT number of pixel</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
           <field>
              <name>BAVCA</name>
              <description> Background alpha value calculation algorithm</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>BPDAV</name>
              <description> Background pre- defined alpha value</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPA_BPV</name>
          <displayName>IPA_BPV</displayName>
          <description>Background pixel value
            register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BPDBV</name>
              <description> Background pre-defined blue value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>BPDGV</name>
              <description> Background pre-defined green value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>BPDRV</name>
              <description> Background pre-defined red value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPA_FLMADDR</name>
          <displayName>IPA_FLMADDR</displayName>
          <description>Foreground LUT memory base address
          register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FLMBADDR</name>
              <description>Foreground LUT memory base address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPA_BLMADDR</name>
          <displayName>IPA_BLMADDR</displayName>
          <description>Background LUT memory base address
           register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BLMADDR</name>
              <description>Background LUT memory base address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPA_DPCTL</name>
          <displayName>IPA_DPCTL</displayName>
          <description>Destination pixel control
          register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DPF</name>
              <description> Destination pixel format</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPA_DPV_ARGB8888</name>
          <displayName>IPA_DPV_ARGB8888</displayName>
          <description>Destination pixel value
          register(When the destination pixel format is ARGB8888)</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DPDBV</name>
              <description> Destination pre-defined blue value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DPDGV</name>
              <description> Destination pre-defined green value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DPDRV</name>
              <description> Destination pre-defined red value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DPDAV</name>
              <description> Destination pre-defined alpha value</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPA_DPV_RGB888</name>
          <displayName>IPA_DPV_RGB888</displayName>
          <description>Destination pixel value
          register(When the destination pixel format is RGB888)</description>
          <alternateRegister>IPA_DPV_ARGB8888</alternateRegister>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DPDBV</name>
              <description> Destination pre-defined blue value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DPDGV</name>
              <description> Destination pre-defined green value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DPDRV</name>
              <description> Destination pre-defined red value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
